app/Views/template/template-frontend.php

// agar template_frontend terkoneksi dengan database
$db = \Config\Database::connect();

$setting = $db->table('tbl_setting')
    ->where('id', 1)
    ->get()
    ->getRowArray();

$th_ajar = $db->table('tbl_th_ajar')
    ->where('status', 1)
    ->get()
    ->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1
SELECT *
FROM `tbl_th_ajar`
WHERE `status` = 1