app/Models/ModelBanner.php

SELECT *
FROM `tbl_banner`
---
    public function getAllData()
    {
        return $this->db->table('tbl_banner')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `ta` = '2022'
AND `stat_pendaftaran` = 1
---
    public function jumlahPendaftar()
    {
        return $this->db->table('tbl_siswa')
            ->where('ta', date('Y'))
            ->where('stat_pendaftaran', 1)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `ta` = '2022'
AND `stat_pendaftaran` = 1
AND `jk` = 'L'
---
    public function jumlahLk()
    {
        return $this->db->table('tbl_siswa')
            ->where('ta', date('Y'))
            ->where('stat_pendaftaran', 1)
            ->where('jk', 'L')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_siswa`
WHERE `ta` = '2022'
AND `stat_pendaftaran` = 1
AND `jk` = 'P'
---
    public function jumlahPr()
    {
        return $this->db->table('tbl_siswa')
            ->where('ta', date('Y'))
            ->where('stat_pendaftaran', 1)
            ->where('jk', 'P')
            ->countAllResults();