app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
    public function detailPengaturan()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()
            ->getRowArray();