app/Models/ModelTa.php

SELECT *
FROM `tbl_th_ajar`
WHERE `status` = 1
---
    public function tampilByStatus()
    {
        return $this->db->table('tbl_th_ajar')
                ->where('status', 1)
                ->get()
                ->getRowArray();