app/Models/ModelSiswa.php

SELECT *
FROM `tbl_siswa`
LEFT JOIN `tbl_jalur_masuk` ON `tbl_jalur_masuk`.`id_jalur_masuk`=`tbl_siswa`.`id_jalur_masuk`
LEFT JOIN `tbl_agama` ON `tbl_agama`.`id_agama`=`tbl_siswa`.`id_agama`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi`=`tbl_siswa`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_siswa`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan`=`tbl_siswa`.`id_kecamatan`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan`=`tbl_siswa`.`id_jurusan`
WHERE `id_siswa` = '1'
---
    public function getBiodataSiswa()
    {
        return $this->db->table('tbl_siswa')
            ->join('tbl_jalur_masuk', 'tbl_jalur_masuk.id_jalur_masuk=tbl_siswa.id_jalur_masuk', 'left')
            ->join('tbl_agama', 'tbl_agama.id_agama=tbl_siswa.id_agama', 'left')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi=tbl_siswa.id_provinsi', 'left')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_siswa.id_kabupaten', 'left')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan=tbl_siswa.id_kecamatan', 'left')
            ->join('tbl_jurusan', 'tbl_jurusan.id_jurusan=tbl_siswa.id_jurusan', 'left')
            ->where('id_siswa', session()->get('id_siswa'))
            ->get()
            ->getRowArray();